/* #define TEST */

/*
	22-11-1991 Sesov Oleg.
	modifed 03.06.96 Alexey Wasilyev

   процедура int transns(NUMBER num,char * str,int w,int pad,int pril);
   перевод чисел в символьное представление в диапазоне от
	     - MAX-1 до + MAX-1
   num - число
   str - выходная строка
   флаг w == 0 -> число в мужском роде,
	w == 1 -> число в женском роде
	w == 2 -> число в среднем роде
   флаг pad - падеж (0 - именительный, ... 6 - предложный)
   флаг pril== 1 - прилагательные
	pril== 0 - существительные
   возвращает num % 100 .Можно использовать для передачи buildnn()

   процедура char * buildnn(int num,
			    char * kor,char * b1,char * b234,char * b5,
			    char * word);
   построить окончание слова в зависимости от числа num
   kor       = корень слова
   b1        = окончание при num заканчивающемся на 1
   b234      = окончание при num заканчивающемся на 2, 3 или 4
   b5        = окончание при num заканчивающемся на другие цифры
   word      = результат
   возвращает указатель на word
   пример :
	  одна палка
	  две, три , четыре палки
	  пять, шесть, семь, десять, ноль палок

   вызов : buildnn(num,"пал","ка","ки","ок",word);
*/

#include <num2word.h>

#include <math.h>
#include <stdio.h>
#define ABS(x)     fabs(x)
#define MAX        1000000000000000.0
#define MAXSIZE    5
#define ROUND(x)   floor((x))
#define MOD(x,y)   fmod((x),(y))
#define DIV(x,y)   ROUND((x)/(y))

#include <string.h>

static char *d1[]= {
  "один",  "два",  "три",  "четыре",  "пять",  "шесть", "семь",
  "восемь",  "девять",  "десять",  "одиннадцать",  "двенадцать",
  "тринадцать",  "четырнадцать",  "пятнадцать",  "шестнадцать",
  "семнадцать",  "восемнадцать",  "девятнадцать",
  "одного",  "двух",  "трех",  "четырех",  "пяти",  "шести", "семи",
  "восеми",  "девяти",  "десяти",  "одиннадцати",  "двенадцати",
  "тринадцати",  "четырнадцати",  "пятнадцати",  "шестнадцати",
  "семнадцати",  "восемнадцати",  "девятнадцати",
  "одному",  "двум",  "трем",  "четырем",  "пяти",  "шести", "семи",
  "восьми",  "девяти",  "десяти",  "одиннадцати",  "двенадцати",
  "тринадцати",  "четырнадцати",  "пятнадцати",  "шестнадцати",
  "семнадцати",  "восемнадцати",  "девятнадцати",
  "одного",  "двух",  "трех",  "четырех",  "пяти",  "шести", "семи",
  "восьми",  "девяти",  "десяти",  "одиннадцати",  "двенадцати",
  "тринадцати",  "четырнадцати",  "пятнадцати",  "шестнадцати",
  "семнадцати",  "восемнадцати",  "девятнадцати",
  "одним",  "двумя",  "тремя",  "четырьмя",  "пятью",  "шестью", "семью",
  "восемью",  "девятью",  "десятью",  "одиннадцатью",  "двенадцатью",
  "тринадцатью",  "четырнадцатью",  "пятнадцатью",  "шестнадцатью",
  "семнадцатью",  "восемнадцатью",  "девятнадцатью",
  "одном",  "двух",  "трех",  "четырех",  "пяти",  "шести", "семи",
  "восьми",  "девяти",  "десяти",  "одиннадцати",  "двенадцати",
  "тринадцати",  "четырнадцати",  "пятнадцати",  "шестнадцати",
  "семнадцати",  "восемнадцати",  "девятнадцати"
  };

 static char *d1pr[]= {
  "первый",  "второй",  "третий",  "четвертый",  "пятый",  "шестой", "седьмой",
  "восьмой",  "девятый",  "десятый",  "одиннадцатый",  "двенадцатый",
  "тринадцатый",  "четырнадцатый",  "пятнадцатый",  "шестнадцатый",
  "семнадцатый",  "восемнадцатый",  "девятнадцатый",
  "первого",  "второго",  "третьего",  "четвертого",  "пятого",  "шестого", "седьмого",
  "восьмого",  "девятого",  "десятого",  "одиннадцатого",  "двенадцатого",
  "тринадцатого",  "четырнадцатого",  "пятнадцатого",  "шестнадцатого",
  "семнадцатого",  "восемнадцатого",  "девятнадцатого",
  "первому",  "второму",  "третьему",  "четвертому",  "пятому",  "шестому", "седьмому",
  "восьмому",  "девятому",  "десятому",  "одиннадцатому",  "двенадцатому",
  "тринадцатому",  "четырнадцатому",  "пятнадцатому",  "шестнадцатому",
  "семнадцатому",  "восемнадцатому",  "девятнадцатому",
  "первого",  "второго",  "третьего",  "четвертого",  "пятого",  "шестого", "седьмого",
  "восьмого",  "девятого",  "десятого",  "одиннадцатого",  "двенадцатого",
  "тринадцатого",  "четырнадцатого",  "пятнадцатого",  "шестнадцатого",
  "семнадцатого",  "восемнадцатого",  "девятнадцатого",
  "первым",  "вторым",  "третьим",  "четвертым",  "пятым",  "шестым", "седьмым",
  "восьмым",  "девятым",  "десятым",  "одиннадцатым",  "двенадцатым",
  "тринадцатым",  "четырнадцатым",  "пятнадцатым",  "шестнадцатым",
  "семнадцатым",  "восемнадцатым",  "девятнадцатым",
  "первом",  "втором",  "третьем",  "четвертом",  "пятом",  "шестом", "седьмом",
  "восьмом",  "девятом",  "десятом",  "одиннадцатом",  "двенадцатом",
  "тринадцатом",  "четырнадцатом",  "пятнадцатом",  "шестнадцатом",
  "семнадцатом",  "восемнадцатом",  "девятнадцатом",

  "первая",  "вторая",  "третья",  "четвертая",  "пятая",  "шестая", "седьмая",
  "восьмая",  "девятая",  "десятая",  "одиннадцатая",  "двенадцатая",
  "тринадцатая",  "четырнадцатая",  "пятнадцатая",  "шестнадцатая",
  "семнадцатая",  "восемнадцатая",  "девятнадцатая",
  "первую",  "вторую",  "третью",  "четвертую",  "пятую",  "шестую", "седьмую",
  "восьмую",  "девятую",  "десятую",  "одиннадцатую",  "двенадцатую",
  "тринадцатую",  "четырнадцатую",  "пятнадцатую",  "шестнадцатую",
  "семнадцатую",  "восемнадцатую",  "девятнадцатую",
  "первой",  "второй",  "третьей",  "четвертой",  "пятой",  "шестой", "седьмой",
  "восьмой",  "девятой",  "десятой",  "одиннадцатой",  "двенадцатой",
  "тринадцатой",  "четырнадцатой",  "пятнадцатой",  "шестнадцатой",
  "семнадцатой",  "восемнадцатой",  "девятнадцатой",
  "первую",  "вторую",  "третью",  "четвертую",  "пятую",  "шестую", "седьмую",
  "восьмую",  "девятую",  "десятую",  "одиннадцатую",  "двенадцатую",
  "тринадцатую",  "четырнадцатую",  "пятнадцатую",  "шестнадцатую",
  "семнадцатую",  "восемнадцатую",  "девятнадцатую",
  "первой",  "второй",  "третьей",  "четвертой",  "пятой",  "шестой", "седьмой",
  "восьмой",  "девятой",  "десятой",  "одиннадцатой",  "двенадцатой",
  "тринадцатой",  "четырнадцатой",  "пятнадцатой",  "шестнадцатой",
  "семнадцатой",  "восемнадцатой",  "девятнадцатой",
  "первой",  "второй",  "третьей",  "четвертой",  "пятой",  "шестой", "седьмой",
  "восьмой",  "девятой",  "десятой",  "одиннадцатой",  "двенадцатой",
  "тринадцатой",  "четырнадцатой",  "пятнадцатой",  "шестнадцатой",
  "семнадцатой",  "восемнадцатой",  "девятнадцатой",

  "первое",  "второе",  "третье",  "четвертое",  "пятое",  "шестое", "седьмое",
  "восьмое",  "девятое",  "десятое",  "одиннадцатое",  "двенадцатое",
  "тринадцатое",  "четырнадцатое",  "пятнадцатое",  "шестнадцатое",
  "семнадцатое",  "восемнадцатое",  "девятнадцатое",
  "первого",  "второго",  "третьего",  "четвертого",  "пятого",  "шестого", "седьмого",
  "восьмого",  "девятого",  "десятого",  "одиннадцатого",  "двенадцатого",
  "тринадцатого",  "четырнадцатого",  "пятнадцатого",  "шестнадцатого",
  "семнадцатого",  "восемнадцатого",  "девятнадцатого",
  "первому",  "второму",  "третьему",  "четвертому",  "пятому",  "шестому", "седьмому",
  "восьмому",  "девятому",  "десятому",  "одиннадцатому",  "двенадцатому",
  "тринадцатому",  "четырнадцатому",  "пятнадцатому",  "шестнадцатому",
  "семнадцатому",  "восемнадцатому",  "девятнадцатому",
  "первого",  "второго",  "третьего",  "четвертого",  "пятого",  "шестого", "седьмого",
  "восьмого",  "девятого",  "десятого",  "одиннадцатого",  "двенадцатого",
  "тринадцатого",  "четырнадцатого",  "пятнадцатого",  "шестнадцатого",
  "семнадцатого",  "восемнадцатого",  "девятнадцатого",
  "первым",  "вторым",  "третьим",  "четвертым",  "пятым",  "шестым", "седьмым",
  "восьмым",  "девятым",  "десятым",  "одиннадцатым",  "двенадцатым",
  "тринадцатым",  "четырнадцатым",  "пятнадцатым",  "шестнадцатым",
  "семнадцатым",  "восемнадцатым",  "девятнадцатым",
  "первом",  "втором",  "третьем",  "четвертом",  "пятом",  "шестом", "седьмом",
  "восьмом",  "девятом",  "десятом",  "одиннадцатом",  "двенадцатом",
  "тринадцатом",  "четырнадцатом",  "пятнадцатом",  "шестнадцатом",
  "семнадцатом",  "восемнадцатом",  "девятнадцатом",
  };

static char * d1w[]={"одна","две",
		     "одну","двух",
		     "одной","двух",
		     "одну","двух",
		     "одной","двумя",
		     "одной","двух"
		    };

static char * d1sr[]={"одно","два",
		      "одно","два",
		      "одному","двум",
		      "одного","двух",
		      "одним","двумя",
		      "одном","двух"
		     };

static char * d10[]={
  "двадцать",  "тридцать",  "сорок",  "пятьдесят",
  "шестьдесят",  "семьдесят",  "восемьдесят",  "девяносто",
  "двадцати",  "тридцати",  "сорока",  "пятьдесяти",
  "шестидесяти",  "семидесяти",  "восьмидесяти",  "девяносто",
  "двадцати",  "тридцати",  "сорока",  "пятьдесяти",
  "шестидесяти",  "семидесяти",  "восьмидесяти",  "девяносто",
  "двадцати",  "тридцати",  "сорока",  "пятьдесяти",
  "шестидесяти",  "семидесяти",  "восьмидесяти",  "девяносто",
  "двадцати",  "тридцати",  "сорока",  "пятьдесяти",
  "шестидесяти",  "семидесяти",  "восьмидесяти",  "девяносто",
  "двадцати",  "тридцати",  "сорока",  "пятьдесяти",
  "шестидесяти",  "семидесяти",  "восьмидесяти",  "девяносто",
  };

static char * d10pr[]={
  "двадцатый",  "тридцатый",  "сороковой",  "пятидесятый",
  "шестидесятый",  "семидесятый",  "восьмидесятый",  "девяностый",
  "двадцатого",  "тридцатого",  "сорокого",  "пятидесятого",
  "шестидесятого",  "семидесятого",  "восьмидесятого",  "девяностого",
  "двадцатому",  "тридцатому",  "сорокому",  "пятьдесятому",
  "шестидесятому",  "семидесятому",  "восьмидесятому",  "девяностому",
  "двадцатого",  "тридцатого",  "сорокого",  "пятидесятого",
  "шестидесятого",  "семидесятого",  "восьмидесятого",  "девяностого",
  "двадцатым",  "тридцатым",  "сороковым",  "пятьдесятым",
  "шестидесятым",  "семидесятым",  "восьмидесятым",  "девяностым",
  "двадцатом",  "тридцатом",  "сороковом",  "пятьдесятом",
  "шестидесятом",  "семидесятом",  "восьмидесятом",  "девяностом",

  "двадцатая",  "тридцатая",  "сороковая",  "пятидесятая",
  "шестидесятая",  "семидесятая",  "восьмидесятая",  "девяностая",
  "двадцатую",  "тридцатую",  "сороковую",  "пятидесятую",
  "шестидесятую",  "семидесятую",  "восьмидесятую",  "девяностую",
  "двадцатой",  "тридцатой",  "сороковой",  "пятидесятой",
  "шестидесятой",  "семидесятой",  "восьмидесятой",  "девяностой",
  "двадцатую",  "тридцатую",  "сороковую",  "пятидесятую",
  "шестидесятую",  "семидесятую",  "восьмидесятую",  "девяностую",
  "двадцатой",  "тридцатой",  "сороковой",  "пятьдесятой",
  "шестидесятой",  "семидесятой",  "восьмидесятой",  "девяностой",
  "двадцатой",  "тридцатой",  "сороковой",  "пятьдесятой",
  "шестидесятой",  "семидесятой",  "восьмидесятой",  "девяностой",

  "двадцатое",  "тридцатое",  "сороковое",  "пятидесятое",
  "шестидесятое",  "семидесятое",  "восьмидесятое",  "девяностое",
  "двадцатого",  "тридцатого",  "сорокого",  "пятидесятого",
  "шестидесятого",  "семидесятого",  "восьмидесятого",  "девяностого",
  "двадцатому",  "тридцатому",  "сорокому",  "пятьдесятому",
  "шестидесятому",  "семидесятому",  "восьмидесятому",  "девяностому",
  "двадцатого",  "тридцатого",  "сорокого",  "пятидесятого",
  "шестидесятого",  "семидесятого",  "восьмидесятого",  "девяностого",
  "двадцатым",  "тридцатым",  "сороковым",  "пятьдесятым",
  "шестидесятым",  "семидесятым",  "восьмидесятым",  "девяностым",
  "двадцатом",  "тридцатом",  "сороковом",  "пятьдесятом",
  "шестидесятом",  "семидесятом",  "восьмидесятом",  "девяностом"
  };

static char * d100[]={
  "сто",  "двести",  "триста",  "четыреста",  "пятьсот",
  "шестьсот",  "семьсот",  "восемьсот",  "девятьсот",
  "сто",  "двести",  "триста",  "четыреста",  "пятьсот",
  "шестьсот",  "семьсот",  "восемьсот",  "девятьсот",
  "ста",  "двумста",  "тремста",  "четыремста",  "пятиста",
  "шестиста",  "семиста",  "восьмиста",  "девятиста",
  "ста",  "двухсот",  "трехсот",  "четырехсот",  "пятисот",
  "шестисот",  "семисот",  "восьмисот",  "девятьсот",
  "ста",  "двумястами",  "тремястами",  "четырестами",  "пятистами",
  "шестистами",  "семистами",  "восьмистами",  "девятистами",
  "ста",  "двухстах",  "трехстах",  "четырехстах",  "пятистах",
  "шестистах",  "семистах",  "восьмистах",  "девятистах"
  };

static char * d100pr[]={
  "сотый",  "двухсотый",  "трехсотый",  "четырехсотый",  "пятисотый",
  "шестисотый",  "семьсотый",  "восьмисотый",  "девятисотый",
  "сотого",  "двухсотого",  "трехсотого",  "четырехсотого",  "пятисотого",
  "шестисотого",  "семьсотого",  "восьмисотого",  "девятисотого",
  "сотому",  "двухсотому",  "трехсотому",  "четырехсотому",  "пятисотому",
  "шестисотому",  "семисотому",  "восьмисотому",  "девятисотому",
  "сотый",  "двухсотого",  "трехсотого",  "четырехсотого",  "пятисотого",
  "шестисотого",  "семьсотого",  "восьмисотого",  "девятисотого",
  "сотым",  "двухсотым",  "трехсотым",  "четырехсотым",  "пятисотым",
  "шестисотым",  "семьсотым",  "восьмисотым",  "девятисотым",
  "сотом",  "двухсотом",  "трехсотом",  "четырехсотом",  "пятисотом",
  "шестисотом",  "семьсотом",  "восьмисотом",  "девятисотом",
  "сотая",  "двухсотая",  "трехсотая",  "четырехсотая",  "пятисотая",
  "шестисотая",  "семьсотая",  "восьмисотая",  "девятисотая",
  "сотую",  "двухсотую",  "трехсотую",  "четырехсотую",  "пятисотую",
  "шестисотую",  "семьсотую",  "восьмисотую",  "девятисотую",
  "сотой",  "двухсотой",  "трехсотой",  "четырехсотой",  "пятисотой",
  "шестисотой",  "семисотой",  "восьмисотой",  "девятисотой",
  "сотую",  "двухсотую",  "трехсотую",  "четырехсотую",  "пятисотую",
  "шестисотую",  "семьсотую",  "восьмисотую",  "девятисотую",
  "сотой",  "двухсотой",  "трехсотой",  "четырехсотой",  "пятисотой",
  "шестисотой",  "семьсотой",  "восьмисотой",  "девятисотой",
  "сотой",  "двухсотой",  "трехсотой",  "четырехсотой",  "пятисотой",
  "шестисотой",  "семьсотой",  "восьмисотой",  "девятисотой",
  "сотое",  "двухсотое",  "трехсотое",  "четырехсотое",  "пятисотое",
  "шестисотое",  "семьсотое",  "восьмисотое",  "девятисотое",
  "сотого",  "двухсотого",  "трехсотого",  "четырехсотого",  "пятисотого",
  "шестисотого",  "семьсотого",  "восьмисотого",  "девятисотого",
  "сотому",  "двухсотому",  "трехсотому",  "четырехсотому",  "пятисотому",
  "шестисотому",  "семисотому",  "восьмисотому",  "девятисотому",
  "сотый",  "двухсотого",  "трехсотого",  "четырехсотого",  "пятисотого",
  "шестисотого",  "семьсотого",  "восьмисотого",  "девятисотого",
  "сотым",  "двухсотым",  "трехсотым",  "четырехсотым",  "пятисотым",
  "шестисотым",  "семьсотым",  "восьмисотым",  "девятисотым",
  "сотом",  "двухсотом",  "трехсотом",  "четырехсотом",  "пятисотом",
  "шестисотом",  "семьсотом",  "восьмисотом",  "девятисотом"
  };

static char neg[]="минус";
static char nl[]="ноль";

static struct { char * core; char *e1,*e2,*e5; int w;
  } wmul[MAXSIZE*6] = {

/*  корень         1       234    567890   */
   {"триллион",    "",       "а",      "ов",     0},
   {"миллиард",    "",       "а",      "ов",     0},
   {"миллион",     "",       "а",      "ов",     0},
   {"тысяч",       "а",       "и",      "",     1},
   {"",            "",       "",      "",     0},

   {"триллион",    "а",       "а",      "ов",     0},
   {"миллиард",    "а",       "а",      "ов",     0},
   {"миллион",     "а",       "а",      "ов",     0},
   {"тысяч",       "у",       "и",      "",     1},
   {"",            "",       "",      "",     0},

   {"триллион",    "у",       "ам",      "ам",     0},
   {"миллиард",    "у",       "ам",      "ам",     0},
   {"миллион",     "у",       "ам",      "ам",     0},
   {"тысяч",       "е",       "ам",      "ам",     1},
   {"",            "",       "",      "",     0},

   {"триллион",    "а",       "а",      "ов",     0},
   {"миллиард",    "а",       "а",      "ов",     0},
   {"миллион",     "а",       "а",      "ов",     0},
   {"тысяч",       "у",      "и",      "",     1},
   {"",            "",       "",      "",     0},

   {"триллион",    "",       "ами",      "ами",     0},
   {"миллиард",    "",       "ами",      "ами",     0},
   {"миллион",     "",       "ами",      "ами",     0},
   {"тысяч",       "ей",     "ами",      "ами",     1},
   {"",            "",       "",      "",     0},

   {"триллион",    "е",       "ах",      "ах",     0},
   {"миллиард",    "е",       "ах",      "ах",     0},
   {"миллион",     "е",       "ах",      "ах",     0},
   {"тысяч",       "е",       "ах",      "ах",     1},
   {"",            "",       "",      "",     0},
  };




#define OVERFLOW "переполнение"

/*#endif*/

#define cat(x)   {if (*v) strcat(v," "); strcat(v,x);}

char * PUBLIC buildnn(int num,char * kor,char * b1,char * b234,char * b5,char * word)
  {
  num %=100;
  strcpy(word,kor);
  if (num<=20 && num >=5)
    strcat(word,b5);
  else
    {
    num %= 10;
    if (num==1)
      strcat(word,b1);
    else if (num>=2 && num<=4)
      strcat(word,b234);
    else strcat(word,b5);
    }
  return word;
  }

void PUBLIC dtrans(int num,char * v,int w,int pad,int pril)
  {
  if (num<0) {cat(neg);num=-num;}
  if (!num) {cat(nl);}
  else  {
   if (pril) {
    num %=1000;
	if (MOD(num,100)==0) {if (num>=100) cat(d100pr[9*pad+54*w+num /100 -1]);}
    else {if (num>=100) cat(d100[num /100 -1]);}
    num %=100;
    if (num<20 && num>0)  {
     cat(d1pr[114*w+19*pad+num-1]);
    }
    else if (num)  {
     if (MOD(num,10)==0) {cat(d10pr[w*48+8*pad+num / 10 - 2]);}
     else {
      cat(d10[num / 10 - 2]);
      num %=10;
      if (num) {cat(d1pr[114*w+19*pad+num-1]);}
     }
    }
   }

   else {
    num %=1000;
    if (MOD(num,100)==0) {if (num>=100) cat(d100[9*pad+54*w+num /100 -1]);}
    else {if (num>=100) cat(d100[num /100 -1]);}
    num %=100;
    if (num<20 && num>0)  {
      if (w && num<=2) {
			if (w == 1) {cat(d1w[2*pad+num-1]);}
			else {cat(d1sr[2*pad+num-1]);}
		       }
      else {cat(d1[19*pad+num-1]);}
      }
    else if (num)  {
     if (MOD(num,10)==0) {cat(d10[8*pad+num / 10 - 2]);}
     else {cat(d10[num / 10 - 2]);}
      num %=10;
      if (num)  {
	if (w && num<=2) {if (w == 1) {cat(d1w[2*pad+num-1]);}
			  else {cat(d1sr[2*pad+num-1]);}
			 }
	else {cat(d1[19*pad+num-1]);}
	}
      }
   }
  }
  }


/*
** преобразование числа в строку
**
** int transns(NUMBER num,char * v,int w)
** num - преобразуемое число
** v   - выходная строка
** w   - ==1 женский род
**       ==0 мужской род
*/

int PUBLIC transns(NUMBER num,char * v,int w,int pad,int pril)
  {
  char word[20];
  NUMBER mult;
  int i;
  int pd;

  v[0]=0;

  if (num>=MAX) {cat(OVERFLOW); return -1;}

  num = ROUND(num);
  if (num == 0) { cat(nl);return 0;}
  if (num < 0) { cat(neg); num = -num;}
  num = MOD(num,MAX);
  mult = MAX;
  i = 0;
  while (mult>=1000) {
    mult = DIV(mult,1000);
    if (num > mult-1) {
      NUMBER cc = DIV(num,mult);
      int    n = MOD(cc,100);
      num = MOD(num,mult);
      if (!num) {pd=pad;} else {pd=0;}
      dtrans(cc,v,(mult<=999)?w:wmul[5*pd+i].w,(mult<=999)?pd:0,(mult<=999)?pril:0);
      if (num) {cat (buildnn(n,wmul[i].core,wmul[i].e1,wmul[i].e2,wmul[i].e5,word));}
      else {cat (buildnn(n,wmul[i].core,wmul[5*pad+i].e1,wmul[5*pad+i].e2,wmul[5*pad+i].e5,word));}}
      i++;
    }

  return MOD(num ,100);
  }

#ifdef TEST
main()
  {
  NUMBER n;
  char v[1000];
  int i;
  do {
    printf(">");
    if (scanf("%lf",&n)<1) break;
    for (i=0;i<6;i++){
     transns(n,v,1,i,1);
     printf("%s\n",v);
    }
    } while(1);
   return;
  }
#endif